{"table_name": "120221_oscarFashion", "description": " The table 120221_oscarFashion is a data structure that records fashion trends during an Oscar event. The 'point' column in this table represents the total number of times a specific fashion item (dress, accessory, etc.) was worn by an Oscar nominee or presenter on the specified date. This data provides insights into popular fashion trends during the given event, helping to track and analyze these trends over time. The 'point' column is non-nullable and stores its values as VARCHAR(128).", "columns": [[{"column_name": "point", "description": " The \"point\" column in table 120221_oscarFashion represents the total number of times a particular fashion item (dress, accessory, etc.) was worn by an Oscar nominee or presenter on the specified date. This data helps analyze and track popular fashion trends during the given event.", "data_type": "VARCHAR(128", "is_nullable": false}]], "tags": "1. Oscar Fashion Analysis\n\n2. Event-specific Fashion Trends\n\n3. Nominee/Presenter Wardrobe Tracking\n\n4. Popularity Ranking of Fashion Items\n\n5. Visual Representation at Red Carpet Events"}
{"table_name": "120419_fox25", "description": " The table 120419_fox25 primarily contains spatial data, with the 'point' column holding geographical coordinates (latitude and longitude). These coordinates are essential for spatial analysis or mapping purposes within the Fox25 dataset. The 'point' column is non-nullable and has a maximum length of 128 characters, suggesting it stores strings formatted as coordinates. Other columns in this table likely contain additional data related to the Fox25 project, such as timestamps, attributes, or measurements.", "columns": [[{"column_name": "point", "description": " The \"point\" column in table 120419_fox25 likely represents geographical coordinates (latitude and longitude) associated with data points from the Fox25 dataset, used for spatial analysis or mapping purposes.", "data_type": "VARCHAR(128", "is_nullable": false}]], "tags": "1. Geospatial Data Analysis\n\n2. Fox25 Dataset\n\n3. Spatial Mapping\n\n4. Geographic Coordinates (Latitude, Longitude)\n\n5. Location-based Data Analysis"}
{"table_name": "120503_finales", "description": " Table 120503_finales is a data structure containing specific data points (point) from an experiment or analysis. The point column represents various types of measurements, such as numerical values, dates, or timestamps. This data is crucial for further analysis and interpretation of the results. The table ensures that all recorded data points are accounted for and non-nullable, ensuring data integrity and consistency in the analysis process.", "columns": [[{"column_name": "point", "description": " The \"point\" column in table 120503_finales represents the specific data points or measurements that were recorded during the experiment or analysis, which may include numerical values, dates, timestamps, or other relevant information. This data is crucial for further analysis and interpretation of the results.", "data_type": "VARCHAR(128", "is_nullable": false}]], "tags": "1. Experimental Data Analysis\n   2. Time-Series Data\n   3. Numerical Measurements\n   4. Scientific Data Management\n   5. Result-Oriented Data Structure"}
{"table_name": "2012emmyCats", "description": " The \"2012emmyCats\" table contains unique identifiers (id) for each row, representing Emmy Award categories from the year 2012. Each category is distinctly named in the `catName` column, with names such as Drama Series, Comedy Series, Lead Actress in a Drama Series, etc., categorizing various nominations for the awards. The table ensures efficient data management and provides insights into the Emmy Awards of 2012.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"2012emmyCats\" table represents unique identifiers for each row, ensuring distinctness and efficient data management across the table containing Emmy Award categories from the year 2012.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "`catName`", "description": " The `catName` column in the `2012emmyCats` table represents the names of the categories for the 2012 Emmy Awards, which include various fields such as Drama Series, Comedy Series, Lead Actress in a Drama Series, etc., categorizing different award nominations.", "data_type": "VARCHAR(255", "is_nullable": false}]], "tags": "1. #2012EmmyAwardsCategories\n\n2. #DataManagement\n\n3. #EmmyAwardNominations\n\n4. #TVAwardsCategories\n\n5. #2012EmmyDatabaseStructure"}
{"table_name": "2012emmys", "description": " The 2012Emmys table is a dataset containing information about the winners at the 64th Primetime Emmy Awards held on September 23, 2012. It includes unique identifiers for each record (id), along with categories of awards won in various fields such as Drama Series, Comedy Series, Miniseries or Movie, and other technical and creative award categories (name). The 'id' is an integer and can be null, while the 'name' is a string of up to 255 characters and cannot be null.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the 2012 Emmys table serves as a unique identifier for each record, ensuring distinctness and proper association within the dataset. This numerical value facilitates efficient data manipulation and retrieval operations.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "name", "description": "2012 Emmys: Column names represent various categories of awards given during the 64th Primetime Emmy Awards ceremony held on September 23, 2012. They include Outstanding Lead Actor/Actress in a Drama Series, Comedy Series, Miniseries or Movie, and other technical and creative award categories.", "data_type": "VARCHAR(255", "is_nullable": false}]], "tags": "1. #64thPrimetimeEmmysAwards\n\n2. #TelevisionAwards\n\n3. #OutstandingLeadActorsAndActresses\n\n4. #DramaSeries, #ComedySeries, #Miniseries or Movie\n\n5. #TechnicalCreativeAwardCategories"}
{"table_name": "2013oscarCats", "description": " The \"2013OscarCats\" table is a database record that captures information about the cats featured during the 2013 Oscars ceremony. Each cat has a unique identifier (`id`) and a name (`catName`), which could be the formal or common name assigned to each feline celebrity. The primary key, `id`, ensures each record can be distinctly referenced within the table. The `catName` column contains the names of the cats that graced the Oscars stage in 2013.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"2013OscarCats\" table is a unique identifier assigned to each record, serving as a primary key to ensure each row can be uniquely referenced and distinguished from others within the table.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "`catName`", "description": " The `catName` column in the `2013OscarCats` table represents the names of the cats that were featured during the 2013 Oscars ceremony. It contains the formal or common names given to these feline celebrities.", "data_type": "VARCHAR(255", "is_nullable": false}]], "tags": "1. #2013OscarsCats: A table containing data about the cats featured in the 2013 Oscars ceremony\n\n2. #CatNames: Represents the formal or common names of the feline celebrities showcased during the 2013 Oscars\n\n3. #PrimaryKeyID: The unique identifier assigned to each record within the 2013OscarsCats table for easy referencing and distinction\n\n4. #2013OscarsEvent: Associates the data with the specific event that took place in 2013, i.e., the Oscars ceremony\n\n5. #CatDataTable: Denotes the table as a collection of cat-related information for the given event."}
{"table_name": "2013oscars", "description": " The \"2013Oscars\" table is a comprehensive database containing details of the 85th Academy Awards held in 2013. The unique identifier, 'id', distinguishes individual records related to nominees, award categories, or other data from this event. The 'name' column provides the essential title for each record, ensuring no duplication within the table. Other columns may include details such as category, nominee name, and winner status, providing a detailed overview of the 2013 Academy Awards.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"2013Oscars\" table is a unique identifier assigned to each record, providing a way to reference and differentiate between individual data entries such as movies, nominees, or award categories from the 2013 Academy Awards event.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "name", "description": "2013Oscars: Table containing details of the 85th Academy Awards held in 2013, featuring information on nominees, winners, categories, and other related data.", "data_type": "VARCHAR(255", "is_nullable": false}]], "tags": "1. #85thAcademyAwardsData\n\n2. #2013OscarsNominees\n\n3. #2013OscarsWinners\n\n4. #Movies_at_the_2013_Academy_Awards\n\n5. #OscarCategories_2013\n\n6. (Optional) #2013_Academy_Awards_Event_Details"}
{"table_name": "academyAwardNominations", "description": " The \"academyAwardNominations\" table is designed to store records of Academy Award nominations, with each record identified by a unique 'id'. The 'status' column indicates whether a nomination was won or simply nominated, offering a concise summary of the outcome for each record. This table provides a comprehensive overview of the Academy Awards history, organizing and presenting data in an easily accessible format. The 'id' is an integer and can be null, while the 'status' is an enumeration limited to 'active' (either \"Won\" or \"Nominated\").", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"academyAwardNominations\" table serves as a unique identifier for each nomination record, ensuring distinctness and orderly organization of data within the table.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "status", "description": " The \"status\" column in the \"academyAwardNominations\" table indicates whether a nomination was won (e.g., \"Won\") or not (\"Nominated\"), providing a brief summary of the outcome for each record.", "data_type": "ENUM('active'", "is_nullable": false}]], "tags": "1. Academy Award Nominations Data\n\n2. Unique Identifier (id)\n\n3. Status (Won/Nominated)\n\n4. Integer Data Type\n\n5. Enumerated Data (Status)"}
{"table_name": "academyAwardNominations2013", "description": " The \"academyAwardNominations2013\" table is a database structure that captures nomination details from the 86th Academy Awards in 2013. The 'id' column serves as a unique identifier for each record, facilitating easy reference and tracking of individual nomination entries. The 'status' column indicates whether a nomination was won or not, represented by 'Won' or 'Nominated'. This information provides clarity on the outcome of each nomination during the awards ceremony. Both columns are of data type INTEGER (for 'id') and ENUM ('active' for 'status'), with the 'id' column allowing null values while the 'status' column does not.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the table \"academyAwardNominations2013\" is a unique identifier assigned to each record, providing a way to easily reference and track individual nomination entries from the 2013 Academy Awards.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "status", "description": " The \"status\" column in the table \"academyAwardNominations2013\" indicates whether a nomination was won or not during the 86th Academy Awards, represented by 'Won' or 'Nominated'. This information provides clarity on the outcome of each nomination.", "data_type": "ENUM('active'", "is_nullable": false}]], "tags": "1. Academy Awards 2013 Nominations\n\n2. Movie Awards Database\n\n3. Oscars Nominees and Winners\n\n4. Film Industry Recognition\n\n5. 86th Academy Awards Data"}
