{"table_name": "geography_index", "description": " The `geography_index` table is a comprehensive geographical database, containing key information about various regions across the globe. It includes columns for Region Name, Country, Latitude, Longitude, Area (in square kilometers), Population, and Time Zone. This structured dataset facilitates efficient data analysis, comparison, and visualization of geographical data on a global scale.", "columns": [null], "tags": "1. Countries\n\n2. Continents\n\n3. Regions (e.g., North America, Europe, Asia)\n\n4. Cities\n\n5. Landforms (e.g., mountains, rivers, deserts)\n\nThese tags represent the broad categories that the geography_index table most likely covers, considering it seems to contain information about various geographical entities."}
{"table_name": "li_districtCourts", "description": " The \"li_districtCourts\" table is designed for storing district court records, with each record uniquely identified by an integer 'id'. Each court is associated with a specific county, which represents the geographical jurisdiction where the court operates. This organization allows for efficient management and retrieval of data based on territories within the database. The 'county' column, though not nullable, only contains enumerated values related to the Suffolk county, providing a focused scope for legal proceedings in this specific region.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"li_districtCourts\" table serves as a unique identifier for each district court record, ensuring distinctness and efficient data retrieval within the database.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "county", "description": " The \"county\" column in the \"li_districtCourts\" table represents the geographical administrative division of a region or state where the district court is located, providing a way to identify the jurisdiction for legal proceedings. This column helps organize courts based on their territories and facilitates efficient management of cases within each county.", "data_type": "ENUM('suffolk'", "is_nullable": false}]], "tags": "1. Database Table: li_districtCourts\n\n2. Jurisdictional Division: County\n\n3. Unique Identifier: ID\n\n4. Legal Proceedings Management: District Courts\n\n5. Geographical Organization: Territorial Jurisdiction"}
{"table_name": "li_electionDistricts", "description": " The \"li_electionDistricts\" table is a database structure for storing electoral district data. It includes a unique identifier, 'id', which ensures distinctness and orderly reference across the database. This 'id' is often an auto-incrementing integer. The table also contains a unique identifier, `edFullID`, that combines district number and name to unambiguously identify each electoral district for cross-referencing and data analysis purposes. This identifier is of type VARCHAR(10) and is not nullable.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"li_electionDistricts\" table serves as a unique identifier for each district, ensuring distinctness and orderly reference across the database. It is typically an auto-incrementing integer.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "`edFullID`", "description": " The `edFullID` column in the `li_electionDistricts` table is a unique identifier that combines district number and name to unambiguously identify each electoral district for cross-referencing and data analysis purposes.", "data_type": "VARCHAR(10", "is_nullable": false}]], "tags": "1. Electoral District Database\n\n2. District Identification System\n\n3. Cross-referencing and Data Analysis\n\n4. Unique Electoral Districts\n\n5. Auto-incrementing ID system"}
{"table_name": "li_electionDistricts2011", "description": " The `li_electionDistricts2011` table provides data about electoral districts from the 2011 elections in Canada. The 'id' column is an integer that uniquely identifies each district within this dataset, while the `edFullID` column acts as a key reference across multiple tables, combining province/territory code and district number into a single, non-nullable value (VARCHAR(10)). These columns ensure consistent and accurate referencing of electoral districts in the provided dataset.", "columns": [[{"column_name": "id", "description": " The 'id' column in the 'li_electionDistricts2011' table represents unique identifiers assigned to each election district during the 2011 elections, ensuring distinct, unambiguous referencing within the dataset.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "`edFullID`", "description": " The `edFullID` column in the `li_electionDistricts2011` table represents a unique identifier for each electoral district in the 2011 elections, combining both the province/territory code and the district number as a single value. It serves as a key reference to link data related to this specific district across multiple tables within the dataset.", "data_type": "VARCHAR(10", "is_nullable": false}]], "tags": "1. Election Districts Data (2011)\n    2. Canadian Electoral Districts\n    3. Provincial-Territorial Electoral Districts (2011)\n    4. Electoral Geography (Canada, 2011)\n    5. Voting District Database (2011 Elections)"}
{"table_name": "li_electionDistricts2012", "description": " The \"li_electionDistricts2012\" table is a dataset containing information about election districts from the year 2012. The 'id' column serves as a unique identifier for each district, while the `edFullID` combines state FIPS code, district number, and election type to create a comprehensive ID, ensuring proper data organization and reference. Both columns are essential for understanding and navigating the dataset effectively.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"li_electionDistricts2012\" table serves as a unique identifier for each district in the 2012 election data, ensuring distinctness and proper referencing across the dataset.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "`edFullID`", "description": " The `edFullID` column in the `li_electionDistricts2012` table is a unique identifier for each election district in the dataset from 2012. It combines the state FIPS code, district number, and election type to create a comprehensive ID for data organization and reference.", "data_type": "VARCHAR(10", "is_nullable": false}]], "tags": "1. Election Data (2012)\n2. District Identification\n3. Geographical Information System (GIS)\n4. Voting Districts\n5. Electoral Statistics (Historical)"}
{"table_name": "li_townshipCouncils", "description": " The \"li_townshipCouncils\" table is designed to store data about various town or local councils, each identified uniquely by `id`. It links these councils with their respective townships through the `townshipID` and `townCouncilID`, ensuring a systematic organization of related data. The names of the governing bodies are represented in the `name` field, which is essential for easy identification and reference within the database. This table provides a valuable resource for managing and analyzing information about township councils across different regions.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"li_townshipCouncils\" table serves as a unique identifier for each record, ensuring distinctness and enabling efficient data retrieval and manipulation.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "`townshipID`", "description": " The `townshipID` column in the `li_townshipCouncils` table uniquely identifies each township, providing a systematic way to link related data such as council members, meetings, and other township-specific information within the database.", "data_type": "INTEGER", "is_nullable": false}, {"column_name": "`townCouncilID`", "description": " The `townCouncilID` column in the `li_townshipCouncils` table serves as a unique identifier for each town or local council, ensuring distinct representation and organization of data associated with these administrative entities.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "name", "description": " The \"li_townshipCouncils\" column represents the names of the local governing bodies responsible for administering townships or similar administrative divisions. This includes councils, committees, boards, or other types of municipal entities as applicable in different regions.", "data_type": "VARCHAR(255", "is_nullable": false}]], "tags": "1. #GovernmentDataManagement\n\n2. #LocalCouncilsDatabase\n\n3. #TownshipAdministration\n\n4. #MunicipalEntitiesDatabase\n\n5. #GeographicalAdminUnitsDB (Geographic Administration Units Database)"}
{"table_name": "li_townships", "description": " The `li_townships` table represents geographical subdivisions within a larger administrative unit, such as a county or district. It contains essential information about each township, including its unique identifier (`id`), name (`name`), area (`area` in square kilometers), population (`population`), and the parent administrative unit's ID (`parent_id`). This table helps maintain a structured database for spatial analysis, demographic studies, and other geographical applications.", "columns": [null], "tags": "1. Geographical Location - For township coordinates or region information\n\n2. Population Statistics - For demographic data about the township residents\n\n3. Government Structure - For details on local government bodies and officials\n\n4. Infrastructure Details - For information about roads, utilities, schools, etc.\n\n5. Historical Background - For significant historical events or figures related to the township"}
{"table_name": "markets", "description": " The \"markets\" table represents various financial marketplaces where trading activities occur. It includes columns for Market ID (unique identifier for each market), Market Name (the name of the market, e.g., NYSE or NASDAQ), Location (geographical location of the market), Type (category of the market, such as stock exchange, commodity exchange, etc.), and Regulator (the governing body responsible for overseeing the market). The table serves to provide a structured overview of different markets, facilitating analysis and comparison.", "columns": [null], "tags": "1. Geography (Location)\n2. Industry Sector (e.g., Technology, Automotive, Retail)\n3. Market Type (B2B, B2C, C2C)\n4. Market Size (Revenue, Volume, Number of Participants)\n5. Key Indicators (Growth Rate, Competitiveness, Regulatory Environment)"}
{"table_name": "nassauED", "description": " The \"nassauED\" table in your database is designed to store and analyze educational attainment data for individuals in Nassau County. It includes a unique identifier ('id') and a categorical column ('name') representing the level of education, ranging from high school diploma to doctoral degree. This table facilitates understanding the demographic distribution of educational attainment levels within the county, which can be valuable for various research and planning purposes. The 'id' field is an integer and allows for efficient data retrieval, while the 'name' column is a VARCHAR with no null values.", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"nassauED\" table serves as a unique identifier for each record, ensuring distinctness and efficient data retrieval across the table.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "name", "description": " The \"nassauED\" table column represents the educational level of individuals in Nassau County, providing data on categories such as high school diploma, some college, associate's degree, bachelor's degree, master's degree, professional degree, and doctoral degree. This information aids in understanding the demographic distribution of educational attainment within the county.", "data_type": "VARCHAR(255", "is_nullable": false}]], "tags": "1. #EducationData\n\n2. #NassauCountyDemographics\n\n3. #HigherEducationStatistics\n\n4. #IndividualEducationalAttainment\n\n5. #SocioeconomicAnalysis (as the table provides insights into the socioeconomic status of Nassau County residents based on their educational attainment)"}
{"table_name": "nassau_legislature", "description": " The \"nassau_legislature\" table represents the membership and legislative activities of the Nassau County Legislature in New York, USA. It includes columns for legislator identifiers (ID), names, districts, party affiliations, tenure start and end dates, and various roles or positions held within the legislature. The table also records votes on legislation and attendance records, providing a comprehensive overview of the legislative body's activities and composition over time.", "columns": [null], "tags": "1. Legislation (Laws, Bills)\n2. Representatives (Politicians, Elected Officials)\n3. Districts (Geographical Areas)\n4. Votes (Decision Making Process)\n5. Session (Legislative Sessions, Meetings)\n\nThese tags represent the main categories that the nassau_legislature table might encompass, giving a broader understanding of the data it contains without limiting it to specific columns. These tags can help in organizing and categorizing the data for easier analysis and interpretation."}
{"table_name": "newsdayMarkets", "description": " The \"newsdayMarkets\" table is designed to store market data with unique identifiers (id) and operational status (status). The 'id' column ensures each record is distinct, while the 'status' column indicates whether a market is open or closed. This allows for quick identification of market statuses and efficient organization of data. The 'status' column only accepts binary values ('open' or 'closed').", "columns": [[{"column_name": "id", "description": " The \"id\" column in the \"newsdayMarkets\" table serves as a unique identifier for each record, ensuring distinctiveness and orderly organization of data entries within the table.", "data_type": "INTEGER", "is_nullable": true}, {"column_name": "status", "description": " The \"status\" column in the \"newsdayMarkets\" table indicates whether a market is currently open or closed based on binary values (either 'open' or 'closed'). This helps users quickly identify operational status for each market.", "data_type": "ENUM('active'", "is_nullable": false}]], "tags": "1. Market Data Management\n2. Real-time Market Status Tracking\n3. Binary Market Operational Status\n4. Unique Identifier for Each Market Entry\n5. Efficient Organization of Market Data"}
{"table_name": "nyc_boroughs", "description": " The `nyc_boroughs` table represents the five boroughs of New York City, namely Manhattan, Brooklyn, Queens, Bronx, and Staten Island. Each row contains essential information about a specific borough, such as Borough Name, Borough Code, Population, Area (in square miles), and Density (population per square mile). The table serves to provide an organized and easily accessible dataset for statistical analysis and visualization of demographic and geographical data related to the boroughs of New York City.", "columns": [null], "tags": "1. Geography (Location)\n2. Administration (Government)\n3. Demographics (Population Characteristics)\n4. Infrastructure (Buildings, Transportation)\n5. Culture & Society (History, Arts, Education)\n\nThese tags represent the broader categories that the table \"nyc_boroughs\" might fall under. Each category encompasses various aspects of the boroughs in New York City. For example:\n\n- Geography: Borough area, population density, coastline length, etc.\n- Administration: Mayor's office, city council representatives, budget, services provided, etc.\n- Demographics: Age distribution, ethnicity, income levels, education levels, etc.\n- Infrastructure: Buildings (residential, commercial, public), transportation systems (subways, buses, roads, bridges), utilities, etc.\n- Culture & Society: Museums, theaters, schools, parks, festivals, neighborhood characteristics, etc."}
{"table_name": "nys_counties", "description": " The `nys_counties` table represents the counties in New York State. It includes column data for County Name, FIPS Code (unique identifier), County Seat, Population, and Area (square miles). This table provides essential geographical and demographic information about each county within New York State.", "columns": [null], "tags": "1. Geography (New York Counties)\n\n2. Administrative Divisions\n\n3. Census Data\n\n4. Population Statistics\n\n5. New York State Governance"}
{"table_name": "nys_legislature", "description": " The `nys_legislature` table represents the New York State Legislature, with data on members of the Senate and Assembly. It includes columns for unique identifiers (ID), name, district, party affiliation, term start and end dates, and other relevant information such as address, phone number, and email. This table serves as a comprehensive resource for tracking legislative representation in New York State.", "columns": [null], "tags": "1. New York State Legislature Data\n\n    - Legislation ID (unique identifier)\n    - Sponsor ID (unique identifier for legislator)\n    - Bill Number\n    - Bill Title\n    - Bill Status\n    - Sponsorship Party\n    - District Represented\n    - Introduction Date\n    - Last Action Date\n    - Type of Legislation (Bill, Resolution, etc.)\n    - Subject Matter (e.g., Education, Healthcare, Economy)\n\nThese tags provide a broad understanding of the table's content and purpose, going beyond just the column names."}
{"table_name": "nys_regions", "description": " The `nys_regions` table represents the administrative regions in New York State, including their unique identifiers (region_id), names (region_name), and FIPS codes (fips_code). It also includes the county_id to link the region with its respective counties, as well as the population (population) and area (area_sq_mi) of each region. This table provides a geographical and demographic breakdown of New York State regions for data analysis and visualization purposes.", "columns": [null], "tags": "1. Geographical Regions (New York State)\n2. Administrative Divisions\n3. Population Centers\n4. Urban-Rural Classification\n5. Economic Regions (NYS)"}
{"table_name": "nys_senate", "description": " The `nys_senate` table represents the composition and details of the New York State Senate. It includes information such as Senator ID, District Number, Name, Party Affiliation, Term Start Date, Term End Date, and District Area (geographical region represented). This table serves to provide a snapshot of the current and past members of the New York State Senate, their tenure, and the areas they represent.", "columns": [null], "tags": "1. New York State Senate Data\n\n2. Legislative Body Information\n\n3. Political Affiliation Data\n\n4. District Representation\n\n5. Term Duration and Expiration\n\n6. Voting Records (implicit, based on the nature of the data)\n\n7. Biographical Details (implicit, as this kind of information is often associated with legislators)"}
{"table_name": "nys_zipcodes", "description": " The `nys_zipcodes` table represents New York State zip codes. It contains essential information about each zip code, including Zip Code (as a unique identifier), County Name, City Name (if applicable), Latitude, Longitude, and Region (North, South, etc.). This table is useful for geographical data analysis within New York State.", "columns": [null], "tags": "1. Geographical Data\n\n2. United States Zip Codes\n\n3. New York State Zipcodes\n\n4. Postal Coding System\n\n5. Location Identification (GIS)"}
{"table_name": "states", "description": " The \"states\" table represents geographical subdivisions within a specific region, typically a country. It includes columns for unique state identifiers (State_ID), state names (State_Name), abbreviations (Abbreviation), and other relevant details such as population, capital city, and area size. The purpose of this table is to provide a structured way to store and manage information about each state in the region, enabling efficient data retrieval and analysis for various applications.", "columns": [null], "tags": "1. Active States: Includes all active, enabled or functional states of the table.\n\n2. Inactive States: Represents any disabled, inactive, or non-functional state of the table.\n\n3. Pending States: Indicates any pending changes or updates to the table that have not been processed yet.\n\n4. Archived States: Refers to the historical records of the table that are no longer in active use but are stored for reference or compliance purposes.\n\n5. Error States: Represents any errors, inconsistencies, or exceptions that may occur within the table. This could include invalid data entries or system failures."}
{"table_name": "suffolk_legislature", "description": " The table `suffolk_legislature` represents the members and legislative body of the Suffolk County Legislature in New York, USA. It includes columns for MemberID (unique identifier), Name, District (representing the geographical district they represent), PartyAffiliation (Democrat or Republican), and TermStart (the start date of their current term). This table provides an overview of the composition of the Suffolk County Legislature, including party affiliations and geographical representation.", "columns": [null], "tags": "1. Legislator Name (first, last)\n\n2. District Number\n\n3. Party Affiliation\n\n4. Term Start Date\n\n5. Term End Date\n\n6. Voting Record (if available)\n\n7. Committee Assignments (if applicable)\n\n8. Biographical Information (optional)\n\n9. Contact Information (email, phone number, etc.)\n\n10. Constituent Services (if applicable)"}
{"table_name": "us_congress_ny", "description": " The `us_congress_ny` table represents U.S. Congress members from the state of New York, spanning various legislative sessions. It includes columns for Member ID (unique identifier), Name, District (representational district), Party Affiliation (Democrat or Republican), State (New York), and Chamber (House or Senate). The table also contains information about the term start and end dates, as well as links to related data such as biographical details and voting records.", "columns": [null], "tags": "1. Political Affiliation (Democrat, Republican)\n2. District Number (NY-01, NY-02, etc.)\n3. State (New York)\n4. Congressional Role (Senator, Representative)\n5. Term of Office (Year started, Year ended)\n\nThese tags provide a high-level categorization of the data in the `us_congress_ny` table, allowing for easy search, analysis, and comparison across different representatives from New York."}
